In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(columns=['A', 'B', 'C'])
df

Empty DataFrame
Columns: [A, B, C]
Index: []

In [3]:
df.loc[0, 'B'] = 1
df.loc[1] = [1, 2, 3]
df

     A  B    C
0  NaN  1  NaN
1    1  2    3

In [4]:
df1 = pd.DataFrame({'A':['a1', 'a2'], 'B':['b1', 'b2']})
df2 = pd.DataFrame({'B':['b1'], 'C':['c1']})

In [5]:
df1.append(df2)

C:\Users\anton\AppData\Local\Temp\ipykernel_4776\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

     A   B    C
0   a1  b1  NaN
1   a2  b2  NaN
0  NaN  b1   c1

In [7]:
df = pd.DataFrame({"color":['red', 'blue', 'red', 'blue']}, index=[True, False, True, False])
df

      color
True    red
False  blue
True    red
False  blue

In [8]:
df.loc[True]

     color
True   red
True   red

In [9]:
colors = ['red', 'blue', 'red', 'blue']
names = ['rose', 'violet', 'tulip', 'hareball']
size = ['big', 'big', 'small', 'small']

df = pd.DataFrame({"colors": colors, "names": names, "size": size})
df

  colors     names   size
0    red      rose    big
1   blue    violet    big
2    red     tulip  small
3   blue  hareball  small

In [10]:
df[[True, False, True, False]]

  colors  names   size
0    red   rose    big
2    red  tulip  small

In [11]:
df['size'] == 'small'

0    False
1    False
2     True
3     True
Name: size, dtype: bool

In [12]:
size_small_mask = df['size'] == 'small'
df[size_small_mask]

  colors     names   size
2    red     tulip  small
3   blue  hareball  small

In [15]:
df = pd.DataFrame({"color": colors, "size": size})
df.index.name = "name"
df.index = names
df

         color   size
rose       red    big
violet    blue    big
tulip      red  small
hareball  blue  small

In [16]:
rose_mask = df.index == 'rose'
df[rose_mask]

     color size
rose   red  big

In [17]:
s = pd.Series(["a", "b", "c", "a", "c"], dtype="category")
s

0    a
1    b
2    c
3    a
4    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [18]:
df = pd.DataFrame({"A":s})
df["B"] = df["A"].astype('category')
df["C"] = pd.Categorical(df["B"])

df

   A  B  C
0  a  a  a
1  b  b  b
2  c  c  c
3  a  a  a
4  c  c  c

In [20]:
df = pd.DataFrame(np.random.choice(['foo', 'bar', 'baz'], size=(1000, 3)))
df = df.apply(lambda col: col.astype('category'))

df.shape
df

       0    1    2
0    foo  foo  foo
1    foo  baz  bar
2    foo  bar  foo
3    foo  bar  baz
4    baz  foo  bar
..   ...  ...  ...
995  foo  bar  baz
996  baz  foo  foo
997  foo  foo  baz
998  baz  foo  foo
999  bar  foo  bar

[1000 rows x 3 columns]

In [21]:
df = pd.DataFrame(np.random.randn(1000, 3), columns=['a', 'b', 'c'])
df

            a         b         c
0    2.008111  1.490759  0.186606
1   -1.610659  0.301472 -0.397196
2    0.029103  0.313880 -0.808897
3   -1.373943 -0.079100  1.103275
4   -0.030090 -0.025050 -0.495774
..        ...       ...       ...
995 -0.197401 -0.793567  1.725364
996 -0.867437  0.043804 -0.011240
997 -0.168545  1.538318 -1.387365
998 -1.494486 -0.016692  1.728183
999 -0.932062  0.843270  0.926451

[1000 rows x 3 columns]

In [22]:
df.corr()

          a         b         c
a  1.000000  0.012180 -0.000654
b  0.012180  1.000000 -0.087186
c -0.000654 -0.087186  1.000000

In [23]:
df = pd.DataFrame({'numbers': [1, 2, 3], 'colors': ['red', 'blue', 'white']})
df

   numbers colors
0        1    red
1        2   blue
2        3  white

In [24]:
df = pd.DataFrame(np.random.randn(5, 3), columns=list("ABC"))
df

          A         B         C
0 -1.719907 -0.277806  2.420184
1 -0.871421 -0.892573  0.121362
2 -1.052792  0.884188 -0.186955
3  0.722239 -0.311848  0.543599
4  0.914894 -0.021358 -1.016146

In [25]:
df = pd.DataFrame(np.arange(15).reshape((5, 3)), columns=list("ABC"))
df

    A   B   C
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [27]:
rng = pd.date_range('2023-01-03', periods=5, freq='T')
df = pd.DataFrame({"Date": rng, "Val": np.random.randn(len(rng))})
df

                 Date       Val
0 2023-01-03 00:00:00  0.911335
1 2023-01-03 00:01:00 -1.229566
2 2023-01-03 00:02:00 -0.978310
3 2023-01-03 00:03:00  0.567022
4 2023-01-03 00:04:00 -0.219993

In [28]:
rng = pd.date_range(start="2023-01-03", periods=5, freq='D')
df = pd.DataFrame({"Date": rng, "Val": np.random.randn(len(rng))})

df

        Date       Val
0 2023-01-03 -1.450089
1 2023-01-04 -0.987475
2 2023-01-05 -0.371291
3 2023-01-06  0.173672
4 2023-01-07  1.525163

In [29]:
rng = pd.date_range(start="2000-01-01", periods=5, freq='T')
df = pd.DataFrame({"Val": np.random.randn(len(rng))}, index=rng)

df

                          Val
2000-01-01 00:00:00  0.265903
2000-01-01 00:01:00 -0.900172
2000-01-01 00:02:00  0.893870
2000-01-01 00:03:00 -0.463915
2000-01-01 00:04:00 -0.453379